Tekla.Structures.Model.ProjectInfo
The ProjectInfo class provides project information about the currently open Tekla Structures model.
The following example gets the project information and shows the value of the Name property
in a message dialog:
using Tekla.Structures.Model;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Model CurrentModel = new Model();
ProjectInfo ProjectInfo = CurrentModel.GetProjectInfo();
if (CurrentModel.GetConnectionStatus())
{
if (ProjectInfo.Name.Length > 0)
{
MessageBox.Show(ProjectInfo.Name);
}
}
}
}

Tekla.Structures.Model.ProjectInfo._Description
The description to the Tekla Structures model.

Tekla.Structures.Model.ProjectInfo._StartDate
Start date information of the project.

Tekla.Structures.Model.ProjectInfo._EndDate
End date information of the project.

Tekla.Structures.Model.ProjectInfo._Designer
Designer information of the project.

Tekla.Structures.Model.ProjectInfo._Object
Object information of the project.

Tekla.Structures.Model.ProjectInfo._Location
Address location information of the project.

Tekla.Structures.Model.ProjectInfo._Address
Address information of the project.

Tekla.Structures.Model.ProjectInfo._PostalBox
Address postal box information of the project.

Tekla.Structures.Model.ProjectInfo._Town
Address town information of the project.

Tekla.Structures.Model.ProjectInfo._Region
Address region information of the project.

Tekla.Structures.Model.ProjectInfo._PostalCode
Address postal code information of the project.

Tekla.Structures.Model.ProjectInfo._Country
Address country information of the project.

Tekla.Structures.Model.ProjectInfo._Builder
Builder information of the project.

Tekla.Structures.Model.ProjectInfo._Name
Name information of the project.

Tekla.Structures.Model.ProjectInfo._ProjectNumber
Project number information of the project.

Tekla.Structures.Model.ProjectInfo._ModelSharingLocalPath
Local sharing folder of the model.

Tekla.Structures.Model.ProjectInfo._ModelSharingServerPath
Web sharing path of the model.

Tekla.Structures.Model.ProjectInfo._Extra1
info 1.

Tekla.Structures.Model.ProjectInfo._Extra2
info 2.

Tekla.Structures.Model.ProjectInfo._Extra3
Internal Extra info 3.

Tekla.Structures.Model.ProjectInfo._GUID
Project GUID.

Tekla.Structures.Model.ProjectInfo.Description
The description of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.StartDate
The start date information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.EndDate
The end date information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Object
The object information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Designer
The designer information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Location
The address location information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Address
The address information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.PostalBox
The address postal box information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Town
The address town information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Region
The address region information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.PostalCode
The address postal code information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Country
The address country information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Builder
The builder information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Name
The name information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.ProjectNumber
The project number information of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.ModelSharingLocalPath
The local folder for model sharing.
Is null if not defined for the model.

Tekla.Structures.Model.ProjectInfo.ModelSharingServerPath
The server path for model sharing.
Is null if not defined for the model.

Tekla.Structures.Model.ProjectInfo.Info1
The Info 1 field of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Info2
The Info 2 field of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.GUID
The GUID field of the ProjectInfo.

Tekla.Structures.Model.ProjectInfo.#ctor
Creates a new Project instance.

Tekla.Structures.Model.ProjectInfo.GetInfo
Get current ProjectInfo.

Tekla.Structures.Model.ProjectInfo.Modify
Modifies the current project information.
Returns: True on success.

Tekla.Structures.Model.ProjectInfo.GetUserProperty(System.String,System.String@)
Retrieves a string property for the ProjectInfo.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ProjectInfo.GetUserProperty(System.String,System.Int32@)
Retrieves an integer property for the ProjectInfo.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ProjectInfo.GetUserProperty(System.String,System.Double@)
Retrieves a double property for the ProjectInfo.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ProjectInfo.SetUserProperty(System.String,System.String)
Sets a string property for the ProjectInfo.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ProjectInfo.SetUserProperty(System.String,System.Double)
Sets a double property for the ProjectInfo.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ProjectInfo.SetUserProperty(System.String,System.Int32)
Sets an integer property for the ProjectInfo.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ProjectInfo.GetIntegerUserProperties(System.Collections.Hashtable@)
Retrieves all integer properties for the ProjectInfo.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ProjectInfo.GetDoubleUserProperties(System.Collections.Hashtable@)
Retrieves all double properties for the ProjectInfo.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ProjectInfo.GetStringUserProperties(System.Collections.Hashtable@)
Retrieves all string properties for the ProjectInfo.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ProjectInfo.GetDynamicStringProperty(System.String,System.String@)
Gets a dynamic string property for the ProjectInfo.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ProjectInfo.SetDynamicStringProperty(System.String,System.String)
Sets a dynamic string property for the ProjectInfo.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ProjectInfo.GetBasePoints
Gets all available base points as a list.
Returns: The list of available base points.

Tekla.Structures.Model.ProjectInfo.GetBasePointByName(System.String)
Gets a base point by given name.
name: The name of the base point.
Returns: If found, the base point, otherwise empty base point.

Tekla.Structures.Model.ProjectInfo.GetBasePointByGuid(System.Guid)
Gets a base point by given guid.
guid: The guid of the base point.
Returns: If found, the base point, otherwise empty base point.

Tekla.Structures.Model.ProjectInfo.GetCurrentCoordsysBasePoint
Gets the current base point, if set.
Returns: The current base point, if set. Otherwise null.

Tekla.Structures.Model.ProjectInfo.SetCurrentCoordsysToBasePoint(Tekla.Structures.Model.BasePoint)
Sets the current base point.
basePoint: The base point to be set as current base point.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.ProjectInfo.GetProjectBasePoint
Gets the project base point, if any set.
Returns: The project base point, if set. Otherwise null.